#    -*- mode: org -*-


Archived entries from file /home/ligon/Research/VESDemand/Empirics/neediness.org


* Order matters when data is missing!                              :noexport:
  :PROPERTIES:
  :ARCHIVE_TIME: 2017-03-14 Tue 15:39
  :ARCHIVE_FILE: ~/Research/CFEDemands/Empirics/cfe_estimation.org
  :ARCHIVE_OLPATH: Rank 1 SVD with Missing Data/Rank 1 SVD Approximation to Matrix with Missing Data
  :ARCHIVE_CATEGORY: cfe_estimation
  :END:
By moving observations with  more missing data to the "end" of the
thin matrix, we (invariably?) obtain better approximations if we use
the updating SVD approach.

#+BEGIN_SRC python :var percent_missing=0.2 :var N=20 :tangle foo.py
  <<df_utils>>
  <<svd_rank1_approximation_with_missing_data>>

  def random_rank1_matrix(n=100,m=2):
      a=np.random.random(size=(n,1))
      a=a/np.linalg.norm(a)
      b=np.random.random(size=(m,1)).T
      b=b/np.linalg.norm(b)

      return a.dot(b)

  np.random.seed(0)
  d=[]
  
  for i in range(N):
      #print i
      X0=pd.DataFrame(random_rank1_matrix(n=100,m=4))
      X=X0.copy()
      X.iloc[np.random.random_sample(X.shape)<percent_missing]=np.nan

      Xhat0=svd_rank1_approximation_with_missing_data(X,return_usv=False,VERBOSE=False,MISSLAST=False)
      Xhat1=svd_rank1_approximation_with_missing_data(X,return_usv=False,VERBOSE=False,MISSLAST=True)

      d.append(df_norm(Xhat0-X0)/np.linalg.norm(X0) - df_norm(Xhat1-X0)/np.linalg.norm(X0))

  d=np.array(d)
  print("Proportion (out of %d) for which approximation is better with missing values last is %5.4f." % (N,np.mean(d>0)))

#+END_SRC

#+results:
: Proportion (out of 20) for which approximation is better with missing values last is 1.0000.

    

